---
title: "Windows Internals: Check Your Privilege - The Curious Case of ETW's SecurityTrace Flag"
date: 2026-01-16
tags: [posts]
excerpt: "Consuming from Microsoft-Windows-Threat-Intelligence without Antimalware-PPL or kernel patching/driver loading."
---

> This blog post is from the original post I made on the [Origin](https://www.originhq.com/) (by Prelude) blog. The original can be found [here](https://www.originhq.com/blog/securitytrace-etw-ppl).

Introduction
---
Recently, while investigating new feature development for our [Origin (by Prelude) Runtime Memory Protection](https://www.preludesecurity.com/runtime-memory-protection) research preview product, we were forced to dig into the inner-workings of Event Tracing for Windows (ETW). In the course of leveraging our internal ETW tooling, which executes at a signing and protection level of [Antimalware Protected Process Light (PPL)](https://www.alex-ionescu.com/the-evolution-of-protected-processes-pass-the-hash-mitigations-in-windows-8-1/), we noticed that it was possible to issue a "stop trace" code to a target ETW session that had an undocumented "security trace" flag enabled - which will be the topic of this blog post - without (seemingly) the necessary privileges required. This undocumented flag appears to ensure that only processes running at Antimalware-PPL can interact with or modify any ETW trace session with this flag enabled. In practice, it seems most applicable to AutoLogger ETW trace sessions (as we will see later). Yet we were able to stop the trace session with only administrative privileges, without any special signing or elevated protection level. If you're familiar with Windows internals you will know that - even if not _officially_ acknowledged - resources created or managed by a protected process generally should not be modifiable by less-privileged entities, including administrative processes. Given that this flag appears to delegate trace-session management exclusively to Antimalware-PPL processes, our interest was piqued.

As we set out to determine how any of this was possible in the first place, this led us to identifying both how to configure and manage this undocumented "security trace" ETW flag without needing Antimalware-PPL. However, and much more practical and impactful, **this allowed us to identify a new method to consume events from ETW providers which require Antimalware-PPL, like Microsoft-Windows-Threat-Intelligence, without running as Antimalware-PPL _and_ without relying on a kernel driver - or any of the usual "patch-the-kernel" gymnastics researchers have historically relied on**. Alongside this post, we are also releasing a public proof of concept that encapsulates this research: [ThreatIntelligenceConsumer](https://github.com/preludeorg/ThreatIntelligenceConsumer).

ETW Session Management
---
Although the functionality for creating and managing ETW sessions is exposed in user-mode on Windows, the kernel is still responsible for the _true_ management of resources related to trace sessions. One of the primary structures used by the kernel to manage a specific ETW session is through the `WMI_LOGGER_CONTEXT` structure.

```js
lkd> dt nt!_WMI_LOGGER_CONTEXT
   +0x000 LoggerId         : Uint4B
   +0x004 BufferSize       : Uint4B
   +0x008 MaximumEventSize : Uint4B
   +0x00c LoggerMode       : Uint4B
   +0x010 AcceptNewEvents  : Int4B
   +0x018 GetCpuClock      : Uint8B
   +0x020 LoggerThread     : Ptr64 _ETHREAD
   +0x028 LoggerStatus     : Int4B
   +0x02c FailureReason    : Uint4B
   +0x030 BufferQueue      : _ETW_BUFFER_QUEUE
   +0x040 OverflowQueue    : _ETW_BUFFER_QUEUE
   +0x050 GlobalList       : _LIST_ENTRY
   +0x060 DebugIdTrackingList : _LIST_ENTRY
   +0x070 DecodeControlList : Ptr64 _ETW_DECODE_CONTROL_ENTRY
   +0x078 DecodeControlCount : Uint4B
   +0x080 BatchedBufferList : Ptr64 _WMI_BUFFER_HEADER
   +0x080 CurrentBuffer    : _EX_FAST_REF
   +0x088 LoggerName       : _UNICODE_STRING
   +0x098 LogFileName      : _UNICODE_STRING
   +0x0a8 LogFilePattern   : _UNICODE_STRING
   +0x0b8 NewLogFileName   : _UNICODE_STRING
<--- Truncated --->
```

This structure, which is quite large, manages a lot of the data and metadata needed for the session including the name of the logger, the state of ETW buffers being written to, Last Branch Record (LBR) and Intel Processor Trace (IPT) [ETW enablement status if applicable](https://www.preludesecurity.com/runtime-memory-protection), flags, and other items of interest. For the purposes of this blog post, we will examine the various flags which are present.

```
+0x330 Flags            : Uint4B
+0x330 Persistent       : Pos 0, 1 Bit
+0x330 AutoLogger       : Pos 1, 1 Bit
+0x330 FsReady          : Pos 2, 1 Bit
+0x330 RealTime         : Pos 3, 1 Bit
+0x330 Wow              : Pos 4, 1 Bit
+0x330 KernelTrace      : Pos 5, 1 Bit
+0x330 NoMoreEnable     : Pos 6, 1 Bit
+0x330 StackTracing     : Pos 7, 1 Bit
+0x330 ErrorLogged      : Pos 8, 1 Bit
+0x330 RealtimeLoggerContextFreed : Pos 9, 1 Bit
+0x330 PebsTracing      : Pos 10, 1 Bit
+0x330 PmcCounters      : Pos 11, 1 Bit
+0x330 PageAlignBuffers : Pos 12, 1 Bit
+0x330 StackLookasideListAllocated : Pos 13, 1 Bit
+0x330 SecurityTrace    : Pos 14, 1 Bit
+0x330 LastBranchTracing : Pos 15, 1 Bit
+0x330 SystemLoggerIndex : Pos 16, 8 Bits
+0x330 StackCaching     : Pos 24, 1 Bit
+0x330 ProviderTracking : Pos 25, 1 Bit
+0x330 ProcessorTrace   : Pos 26, 1 Bit
+0x330 QpcDeltaTracking : Pos 27, 1 Bit
+0x330 MarkerBufferSaved : Pos 28, 1 Bit
+0x330 LargeMdlPages    : Pos 29, 1 Bit
+0x330 ExcludeKernelStack : Pos 30, 1 Bit
```

Although the mask of flags is technically represented by `WMI_LOGGER_CONTEXT.Flags`, the symbols contain a convenient breakdown of the various values which are available. As we can see, `SecurityTrace` is a flag which is present and will be the subject of this blog post. By itself, however, this flag does not indicate what it is used for, other than the fact that it denotes the trace is somehow related to security.

To get a sense as to what this flag may be used for, we first enumerated all of the trace sessions which contained this flag. Note that the list of active loggers cannot exceed 0x50 (80), as this currently is the maximum number of supported loggers on a system. WinDbg, which we use for our research, is a very powerful [tool](https://blog.trailofbits.com/2023/11/22/etw-internals-for-security-research-and-forensics/) for ETW analysis.

```js
lkd> dx ((nt!_WMI_LOGGER_CONTEXT*(*)[0x50])(((nt!_ESERVERSILO_GLOBALS*)&nt!PspHostSiloGlobals)->EtwSiloState->EtwpLoggerContext))->Where(l => l != 1).Where(l => l->SecurityTrace == 1).Select(i => i->LoggerName)
((nt!_WMI_LOGGER_CONTEXT*(*)[0x50])(((nt!_ESERVERSILO_GLOBALS*)&nt!PspHostSiloGlobals)->EtwSiloState->EtwpLoggerContext))->Where(l => l != 1).Where(l => l->SecurityTrace == 1).Select(i => i->LoggerName)                
    [5]              : "DefenderApiLogger" [Type: _UNICODE_STRING]
    [6]              : "DefenderAuditLogger" [Type: _UNICODE_STRING]
```

There are only two trace sessions with this feature enabled - DefenderApiLogger and DefenderAuditLogger. These trace sessions are associated with Microsoft Defender. If one attempts to analyze the relevant binaries, you will not find the creation of these ETW sessions present (via `StartTrace`). This is because these sessions are registered as [AutoLogger](https://learn.microsoft.com/en-us/windows/win32/etw/configuring-and-starting-an-autologger-session) ETW sessions. For the unfamiliar, AutoLogger sessions are used in order for some loggers to consume events fairly early (all things considered) in the boot process and are not created by a particular process, but instead are created by the kernel directly (unlike most "normal" sessions - which are created by a particular process invoking `StartTrace`). These sessions are configured through the Registry via `HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\WMI\Autologger`.

<img src="{{ site.url }}{{ site.baseurl }}/images/securitytrace1.png" alt="">

By examining one of the AutoLogger sessions associated with Microsoft Defender we can glean further insight, potentially, into the `SecurityTrace` feature.

<img src="{{ site.url }}{{ site.baseurl }}/images/securitytrace2.png" alt="">

The DefenderApiLogger key itself contains AutoLogger-compliant configuration settings (not all of the ETW trace session configuration settings are available to AutoLoggers). As we can see in the above image, there are no configuration options related to "Flags" or any other moniker which would indicate configuration of various features such as `SecurityTrace`, etc. Moreover, if we put AutoLogger sessions aside and look at the `EVENT_TRACE_PROPERTIES` structure, which is used by callers of `StartTrace` to create a new ETW session programmatically, there _still_ are no options to configure an item such as a "security trace" feature or a `SecurityTrace` flag.

In the case of DefenderApiLogger, all that is present are a list of AutoLogger-compliant ETW settings, along with a list of GUIDs for the various ETW providers which the DefenderApiLogger trace session wishes to consume from. For example, the Microsoft-Windows-Services ETW provider is represented by the first GUID present in the subkey, `0063715B-EEDA-4007-9429-AD526F62696E`. Each of these keys contains additional settings, such as the configuration of how a particular provider should emit events or how the logger should consume them - including an additional subkey named "Filters" (if present) which denotes various ETW filters (event ID filtering, etc.).

Still, however, there is nothing particularly identifiable about any of these configuration settings that would indicate the configuration of `SecurityTrace`. Given that the `WMI_LOGGER_CONTEXT` structure is a kernel-only structure, we further sought to understand how the ETW runtime in kernel-mode manages the undocumented `SecurityTrace` feature.

SecurityTrace Logger Flag
---
We've mentioned the `SecurityTrace` flag - but what does it actually _do_? One of the clearest ways to answer this is to look where this flag is evaluated (or set). The primary place where `SecurityTrace` is evaluated is in the Windows kernel, specifically the `EtwpQueryTrace`. As the name suggests, this function handles queries against a target ETW session. In practice, when you use a built-in tool like `logman` to retrieve details about an ETW trace session, the request ultimately funnels down to `EtwpQueryTrace` in order to be serviced.

<img src="{{ site.url }}{{ site.baseurl }}/images/securitytrace3.png" alt="">

Before talking about how `SecurityTrace` is evaluated in this function it is worth talking about how queries _actually_ work - as this information will become prevalent in the latter portion of this blog.

ETW session query functionality resides around the `WMI_LOGGER_INFORMATION` structure. This undocumented structure is what is actually used by the low-level user-mode caller, `NtTraceControl` (via `ControlTrace`) for most ETW operations, such as starting or querying a trace. This structure is what is sent to the kernel - not the higher-level (and documented) `EVENT_TRACE_PROPERTIES` structure present in the Windows SDK. Although the Windows Research Kernel (WRK) has a definition of this structure, it has seen quite a few updates since the WRK was last updated. Luckily, the structure is present in `combase.dll` (as an aside, COM is notoiously hard to debug, so Microsoft actually ships private symbols for `combase.dll`. Given COM intersects with much of the OS, it can be a gold mine for information like this).

```js
0:000> dt combase!_WMI_LOGGER_INFORMATION
   +0x000 Wnode            : _WNODE_HEADER
   +0x030 BufferSize       : Uint4B
   +0x034 MinimumBuffers   : Uint4B
   +0x038 MaximumBuffers   : Uint4B
   +0x03c MaximumFileSize  : Uint4B
   +0x040 LogFileMode      : Uint4B
   +0x044 FlushTimer       : Uint4B
   +0x048 EnableFlags      : Uint4B
   +0x04c AgeLimit         : Int4B
   +0x04c FlushThreshold   : Int4B
   +0x050 Wow              : Pos 0, 1 Bit
   +0x050 QpcDeltaTracking : Pos 1, 1 Bit
   +0x050 LargeMdlPages    : Pos 2, 1 Bit
   +0x050 ExcludeKernelStack : Pos 3, 1 Bit
   +0x050 V2Options        : Uint8B
   +0x058 LogFileHandle    : Ptr64 Void
   +0x058 LogFileHandle64  : Uint8B
   +0x060 NumberOfBuffers  : Uint4B
   +0x060 InstanceCount    : Uint4B
   +0x064 FreeBuffers      : Uint4B
   +0x064 InstanceId       : Uint4B
   +0x068 EventsLost       : Uint4B
   +0x068 NumberOfProcessors : Uint4B
   +0x06c BuffersWritten   : Uint4B
   +0x070 LogBuffersLost   : Uint4B
   +0x070 Flags            : Uint4B
   +0x074 RealTimeBuffersLost : Uint4B
   +0x078 LoggerThreadId   : Ptr64 Void
   +0x078 LoggerThreadId64 : Uint8B
   +0x080 LogFileName      : _UNICODE_STRING
   +0x080 LogFileName64    : _STRING64
   +0x090 LoggerName       : _UNICODE_STRING
   +0x090 LoggerName64     : _STRING64
   +0x0a0 RealTimeConsumerCount : Uint4B
   +0x0a4 SequenceNumber   : Uint4B
   +0x0a8 LoggerExtension  : Ptr64 Voidf
   +0x0a8 LoggerExtension64 : Uint8B
```

`WMI_LOGGER_INFORMATION` acts as a _translation_ layer to extract information from, or store information into, the target trace session's `WMI_LOGGER_CONTEXT` from the original `EVENT_TRACE_PROPERTIES` structure associated with the target operation (such as `StartTrace` or `ControlTrace`).

`Sechost.dll`, the user-mode component which receives the high-level query request from user-mode, translates the `EVENT_TRACE_PROPERTIES` structure into the appropriate `WMI_LOGGER_INFORMATION` structure - which then is sent to kernel-mode and is populated by the target `WMI_LOGGER_CONTEXT` structure. This is then translated back into the expected `EVENT_TRACE_PROPERTIES` structure provided by the caller of [`ControlTrace`](https://learn.microsoft.com/en-us/windows/win32/api/evntrace/nf-evntrace-controltracew) query operation. This translation is achieved in `Sechost.dll` via `EtwpCopyPropertiesToInfo` (`EVENT_TRACE_PROPERTIES` -> `WMI_LOGGER_INFORMATION`) and `EtwpCopyInfoToProperties` (`WMI_LOGGER_INFORMATION` -> `EVENT_TRACE_PROPERTIES`).

<img src="{{ site.url }}{{ site.baseurl }}/images/securitytrace4.png" alt="">

What does this have to do with an ETW "security trace"? The actual functionality of a query operation, as we saw previously in `EtwpQueryTrace`, is gated by the presence of the target trace session's `WMI_LOGGER_CONTEXT.Flags.SecurityTrace` bit. In order for the target session's `WMI_LOGGER_INFORMATION` structure to be populated from the `WMI_LOGGER_CONTEXT` structure (in other words, in order for a trace query operation to take place), the caller process (i.e., the process which is performing the query, such as `logman.exe` or any other caller of `ControlTrace`) must contain _at least_ Antimalware-PPL signing level/privilege.

<img src="{{ site.url }}{{ site.baseurl }}/images/securitytrace5.png" alt="">

This means it is not even possible to query these ETW sessions from a process which has, for example, `SYSTEM` privileges.

<img src="{{ site.url }}{{ site.baseurl }}/images/securitytrace6.png" alt="">

However, the `SecurityTrace` feature is more useful than _just_ filtering the ability to query a session from user-mode directly via `ControlTrace` with the `EVENT_TRACE_CONTROL_QUERY` control code (although it is one of, if not _the_ fundemental operation it is used for). The `SecurityTrace` flag is also checked in other security-relevant code paths. **Curiously, however, the check is not present when the "stop ETW trace session" code path (`EtwpStopLogger` in `Sechost.dll`, `EtwpStopTrace` in NT) is exercised**.

In the kernel, the presence of the `SecurityTrace` bit is checked in `EtwpStopLoggerInstance` (which is called by `EtwpStopTrace`). However, the check is _not_ "security-related" (i.e., validating the calling process is running at Antimalware-PPL) and simply is to, if the target trace session had the Microsoft-Windows-Security-Auditing provider enabled, update global information about this provider - which has special handling in the kernel. This is because, as we will see later, one of the ways in which the `SecurityTrace` feature can be enabled is to consume from the Microsoft-Windows-Security-Auditing ETW provider in a very specific manner.

<img src="{{ site.url }}{{ site.baseurl }}/images/securitytrace7.png" alt="">

Given no explicit Antimalware-PPL check occurs (and that a stop operation also does not result in a query, which would implicitly perform the Antimalware-PPL check) between the issuing of the stop code and the trace session being stopped, if the name of the target session with `SecurityTrace` enabled is known it is still possible for a process with only administrative privileges (`SYSTEM` in the case of the Defender session due to additional security descriptors) privileges to stop an ETW trace session with the `SecurityTrace` flag present (even though querying such a session would require the querying process to possess Antimalware-PPL). Though, as just mentioned, additional measures such as security descriptors can further tighten the permissions needed to perform such an action on a trace session.

```c
eventProperties->Wnode.Guid = k_DefenderApiLoggerGuid;
eventProperties->LoggerNameOffset = sizeof(EVENT_TRACE_PROPERTIES);
   
error = ControlTraceW(0,
                      L"DefenderApiLogger",
                      eventProperties,
                      EVENT_TRACE_CONTROL_STOP);
if (error != ERROR_SUCCESS)
{
    goto Exit;
}

wprintf(L"[+] Successfully stopped DefenderApiLogger trace session.\n");
```

<img src="{{ site.url }}{{ site.baseurl }}/images/securitytrace8.png" alt="">

Lastly, `SecurityTrace` and Antimalware-PPL checks almost always occur in tandem with the `EtwCheckSecurityLoggerAccess` kernel function. This is the actual function which performs the check for if the requesting/querying process has the necessary privilege (Antimalware-PPL) the operation. This function [is also responsible](https://jonny-johnson.medium.com/peeling-back-the-mask-how-the-threat-intelligence-provider-is-protected-9968c38c5481) for ensuring that only Antimalware-PPL processes can enable Microsoft-Windows-Threat-Intelligence related telemetry on desired processes. Not all Microsoft-Windows-Threat-Intelligence events are generated by "default" even with the appropriate keywords enabled. For example, processes must be _opted-in_ to emitting specific events, such as reading/writing to/from memory. Processes do not emit these events by default.

<img src="{{ site.url }}{{ site.baseurl }}/images/securitytrace9.png" alt="">

To summarize: the point, in our view, of the `SecurityTrace` flag seems to be to prevent non-Antimalware-PPL processes from accessing ETW data specific to sessions (more specifically, as we will see, AutoLogger trace sessions) with this bit set. This brings up the obvious question: how can one enable this feature in the first place? Additionally, could there be any implications for sessions which have the `SecurityTrace` feature enabled?

SecurityTrace - AutoLogger Sessions
---
In our analysis we identified three ways to enable the `SecurityTrace` feature. The first two methods happen indirectly through the specific configuration of an AutoLogger trace session.

AutoLogger sessions go through a special code path in the kernel in order to have all of the requested providers enabled (this will be important for later in the blog post). AutoLoggers trace sessions have their target providers enabled via `EtwpEnableAutoLoggerProvider` (instead of `EtwEnableTrace` directly). This function begins by extracting all of the provider subkeys in the target AutoLogger Registry key entry, iterating by provider GUID. If any of the target providers are either Microsoft-Windows-Kernel-Audit-Api-Calls or Microsoft-Windows-Threat-Intelligence, the target trace's `WMI_LOGGER_CONTEXT` structure is updated to contain the `SecurityTrace` flag.

<img src="{{ site.url }}{{ site.baseurl }}/images/securitytrace10.png" alt="">

The key here to remember is that the sessions are not started in context of any particular process - meaning there is no Antimalware-PPL check to be done at this point because the requesting "process" is the `System` process - in other words, the kernel itself. Traditionally, an ETW trace session cannot enable Microsoft-Windows-Threat-Intelligence because of the fact that when `EnableTraceEx2` is called, the caller process has its identity verified - and if it is not an Antimalware-PPL process, an access denied error is propogated back to the caller.

The difference for AutoLoggers resides in the fact that there is no check to be done on a caller of `EnableTraceEx2` because provider enablement for AutoLoggers it not tied to a particular process identity, as it does not involve a process calling `EnableTraceEx2`. The kernel itself is responsible for enabling all of the requested providers (which are listed, as previously shown, in the Registry for each AutoLogger). This is why the presence of the `SecurityTrace` flag is important, as it's purpose is to protect AutoLogger sessions which have enabled privileged providers, like Microsoft-Windows-Threat-Intelligence, from being consumed by non-Antimalware-PPL processes. Although nothing can be done to check the identity of a process enabling a particular provider for an AutoLogger trace session at the time of enablement (as there is no process context to check), the OS can at least delegate this check to later, when a process attempts to then _consume_ from this session. This is exactly where `SecurityTrace` comes into play.

The second way an AutoLogger can enable this capability is by setting an undocumented, but valid, AutoLogger Registry configuration value. The value in this case is `EnableSecurityProvider`. This is achieved in `EtwpStartAutoLogger` in the kernel (note that `SecTraceUnion` is _user-defined_ and is not the name of the union which is actually used in the `WMI_LOGGER_INFORMATION` structure we have previously mentioned. `Flags` in this case is a 1-to-1 mapping of `Flags` in the target session's `WMI_LOGGER_CONTEXT`, as we will see later).

<img src="{{ site.url }}{{ site.baseurl }}/images/securitytrace11.png" alt="">

As a point of contention, when the `EnableSecurityProvider` AutoLogger key  is set a few additional implicit actions occur. Any AutoLogger which has this key set will _automatically_ be opted-in to consuming the Microsoft-Windows-Security-Auditing ETW provider and the target logger ID is added to the list of known loggers consuming from this provider, via the `ETW_SILODRIVERSTATE` structure managed `PspHostSiloGlobals` in the kernel. This is because the `EtwpSecurityProviderGuidEntry` is always set to the Microsoft-Windows-Security-Auditing provider in `EtwpPreInitializeSiloState`.

<img src="{{ site.url }}{{ site.baseurl }}/images/securitytrace12.png" alt="">

Additionally, the first logger ID in the `EtwpSecurityLoggers` array is hardcoded, in `EtwpPreInitializeSiloState`, to the logger ID of 3 - which is always reserved for the EventLog-Security trace session. And, as mentioned, any AutoLogger which specifies the `EnableSecurityProvider` Registry value will be added to this list - as well as have the `SecurityTrace` bit enabled.

<img src="{{ site.url }}{{ site.baseurl }}/images/securitytrace13.png" alt="">

In addition there is a "non-AutoLogger" method to enable the `SecurityTrace` flag without running at Antimalware-PPL (and also, for that matter, dynamically/programmatically without the help of the AutoLogger Registry keys). Additionally, we will outline how it is possible to also consume from such traces without Antimalware-PPL.

WMI_LOGGER_INFORMATION
---
As previously mentioned there is a level of abstraction, in user-mode, between the documented `EVENT_TRACE_PROPERTIES` structure and the kernel-mode `WMI_LOGGER_CONTEXT` structure - and that is the `WMI_LOGGER_INFORMATION` structure. Taking a look at this structure, there is some interesting behavior present. Specifically, `Flags` and `LogBuffersLost`:

```js
0:000> dt combase!_WMI_LOGGER_INFORMATION
    <--- Truncated --->
   +0x070 LogBuffersLost   : Uint4B
   +0x070 Flags            : Uint4B
   <--- Truncated --->
```

As seen above, both of these members are located at the same place in memory (offset 0x70). This infers these two members are actually part of a _union_ (represented by our `SecTraceUnion` union earlier), and only one of the values can be valid at a time. `LogBuffersLost`, which is present in the documented `EVENT_TRACE_PROPERTIES` structure is unioned with another member which is not present in the documented structure: `Flags`. This `Flags` member, as we mentioned earlier, is directly imported from the intermediary `WMI_LOGGER_INFORMATION` structure, provided by user-mode, into the `Flags` member of the `WMI_LOGGER_CONTEXT` structure in kernel mode.

<img src="{{ site.url }}{{ site.baseurl }}/images/securitytrace14.png" alt="">

